book/beginning-r.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-29 Mon 10:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beginning R</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Beginning R</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ec0b81">1. Objectives and Overview</a></li>
<li><a href="#org1a05b9f">2. Rstudio is not R</a></li>
<li><a href="#orga9d3bc6">3. Installing R</a>
<ul>
<li><a href="#orga4902b5">3.1. Another thing you may want</a></li>
</ul>
</li>
<li><a href="#orgefa3350">4. Installing RStudio</a></li>
<li><a href="#org793c936">5. Simple demonstration of Rmd- &gt; HTML Without RStudio</a></li>
<li><a href="#org76d11aa">6. More: What is R</a></li>
<li><a href="#orgbe00cf7">7. Detailed Installation Instructions</a>
<ul>
<li><a href="#orga7c773f">7.1. Downloading R</a></li>
<li><a href="#org817ce33">7.2. Testing Your R Installation from the Terminal</a></li>
<li><a href="#org5cbcb1f">7.3. Test for R in Emacs</a></li>
</ul>
</li>
<li><a href="#org3c57fb1">8. R Coding Basics</a></li>
<li><a href="#org098f48b">9. Types</a>
<ul>
<li><a href="#org782dd7b">9.1. Determining the type of an R variable is straightforward.</a></li>
<li><a href="#org4da6d49">9.2. Lists and other data structures in R</a></li>
<li><a href="#org8d788f2">9.3. Data Frames</a>
<ul>
<li><a href="#orgc98d957">9.3.1. Selection by Booleans</a></li>
<li><a href="#org9f34a90">9.3.2. Accessing Data in R Assessment - Practice</a></li>
</ul>
</li>
<li><a href="#orge9772fd">9.4. Loops</a>
<ul>
<li><a href="#org16007f9">9.4.1. For Loop</a></li>
<li><a href="#orgefe189d">9.4.2. Test your understanding</a></li>
</ul>
</li>
<li><a href="#org831a39d">9.5. While Loop</a>
<ul>
<li><a href="#org3e2e08d">9.5.1. Conditionals</a></li>
<li><a href="#org87a9afc">9.5.2. While (again)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6882e9a">10. Functions</a></li>
<li><a href="#orgf7fa9bf">11. Libraries for R</a>
<ul>
<li><a href="#orge20216b">11.1. What are some popular libraries?</a></li>
</ul>
</li>
<li><a href="#orgb0dbc38">12. Walking Through Some of R's Features</a></li>
<li><a href="#orgd6ddc23">13. Assessing your R Skills</a>
<ul>
<li><a href="#org3d2568b">13.1. Accessing Data in R - Assessment</a>
<ul>
<li><a href="#org5b0541f">13.1.1. Task</a></li>
<li><a href="#orgdfa7623">13.1.2. Goal/Purpose</a></li>
<li><a href="#org57d107a">13.1.3. Instructions</a></li>
<li><a href="#orgbf5856a">13.1.4. Comments</a></li>
<li><a href="#org9442ea8">13.1.5. Hints</a></li>
</ul>
</li>
<li><a href="#org62b6f76">13.2. Hangman in R</a>
<ul>
<li><a href="#orgc3e8bdd">13.2.1. Words of Encouragement</a></li>
<li><a href="#orgb689e22">13.2.2. Task</a></li>
<li><a href="#org3c27e32">13.2.3. Detail (basically the same as before, with minor adaptations)</a></li>
<li><a href="#orgc86cefa">13.2.4. Comments</a></li>
<li><a href="#org0f159e6">13.2.5. How I Will Grade</a></li>
<li><a href="#org837e7b1">13.2.6. Hints</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3ec0b81" class="outline-2">
<h2 id="org3ec0b81"><span class="section-number-2">1.</span> Objectives and Overview</h2>
<div class="outline-text-2" id="text-1">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460263215?h=f91db2a2dc" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460263215">Ha : Introduction to Working with R (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Introduces the Goals of this Segment of the Course: Using R</p>
</div>
</div>

<div id="outline-container-org1a05b9f" class="outline-2">
<h2 id="org1a05b9f"><span class="section-number-2">2.</span> Rstudio is not R</h2>
<div class="outline-text-2" id="text-2">
<p>
R is a computer programming language. Rstudio is an integrated development environment that facilitates writing R code and in interacting with data as well as exporting documents that mix text, code, and other output of analyses, both statistical and visual. RStudio is <i>opinionated.</i> This means that it makes certain choices to facilitate the ease of user interaction. For many users those are sensible choice, but our task is to develop the skills to create an environments that favor our choices and that allow us to adapt them  if they are not met or they change. For that reason I emphasize interacting with R directly and using a different environment for writing, evaluating, and exporting R code.
</p>
</div>
</div>

<div id="outline-container-orga9d3bc6" class="outline-2">
<h2 id="orga9d3bc6"><span class="section-number-2">3.</span> Installing R</h2>
<div class="outline-text-2" id="text-3">
<p>
Installing R on Ubuntu is a straightforward <code>sudo apt install r-base</code>. However, this Ubuntu package often trails the development of R by several months. That almost never matters for general use. However, if you are using a very new method, or one where the packages are being updated frequently you may want to track the repository maintained by the r-project. Adding a repository is another "apt" command, and not too difficult. I am using the Ubuntu package here. 
</p>

<p>
More installation details can be found here: <a href="https://computingforgeeks.com/how-to-install-r-and-rstudio-on-ubuntu-debian-mint/">Link</a>.
</p>

<p>
<a href="#orgbe00cf7">Below</a> I show you some more detailed instructions.
</p>

<p>
This <a href="https://linuxize.com/post/how-to-install-r-on-ubuntu-20-04/">blog</a> shows you how to add the CRAN (r-project) repository first. 
</p>
</div>
<div id="outline-container-orga4902b5" class="outline-3">
<h3 id="orga4902b5"><span class="section-number-3">3.1.</span> Another thing you may want</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Many document conversions, those used by RStudio and many other applications, make use of a wonderful swiss-army knife piece of software: <a href="https://pandoc.org/">pandoc</a>. This is the PAN DOCument conversion tool. The latest version can be found on their <a href="https://github.com/jgm/pandoc/releases/tag/2.10.1">github page.</a> "Deb" files are easy to install (in fact the <code>dpkg</code> tool is running under the hood of most of the <code>apt</code> installations we have been using). After downloading the deb file, and making sure you know where it is, you would <code>cd</code> to that directory and run <code>sudo dpkg -i &lt;the package name&gt;</code>. Where "i" stands for install.
</p>
</div>
</div>
</div>
<div id="outline-container-orgefa3350" class="outline-2">
<h2 id="orgefa3350"><span class="section-number-2">4.</span> Installing RStudio</h2>
<div class="outline-text-2" id="text-4">
<p>
Should you install RStudio? It is a wonderful piece of software, but its graphical interface can shield you from knowing what the underlying tools are. This can impede your growth as an R user, and your ability to implement the cutting-edge or idiosyncratic analysis method you may need in the future. My advice is to learn the base R first, and then expand to RStudio if you find it convenient. 
</p>

<p>
Opinions differ on the R or RStudio choice. Here are couple of links to further discussion and opinions on RStudio and the tidyverse versus base R.
<a href="https://github.com/matloff/TidyverseSkeptic">Should you?</a>
<a href="https://news.ycombinator.com/item?id=20362626">More debate.</a>
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262566?h=dfa81af922" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262566">Hb : Installing R on Linux (Xubuntu; i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Demonstrating the R installation process on Xubuntu and some early versions of how to test out if your installation is functioning and if it is talking to Emacs.</p>
</div>
</div>

<div id="outline-container-org793c936" class="outline-2">
<h2 id="org793c936"><span class="section-number-2">5.</span> Simple demonstration of Rmd- &gt; HTML Without RStudio</h2>
<div class="outline-text-2" id="text-5">
<p>
There are many inputs for "knitting". The one I prefer is Rnw which goes via LaTeX to pdf. You don't have to know too much about that processing route for the moment, but it gives you a lot of future flexibility. It gives you exquisite control over the appearance of your final product. It may however be overkill for simple projects. 
</p>
</div>
</div>
