chapters/beginning-r.org
* More: What is R
   R is a programming language targeting data and its statistical analysis. 
   
   The [[https://doi.org/10.1080/10618600.1996.10474713][history of R]] is via a language called S and a version of Lisp called "Scheme." Thus, R occupies a rather unique place as a hybrid language. It has some functional features, while also having a lot of [[https://en.wikipedia.org/wiki/Domain-specific_language][domain specific]] terminology.  

   It's main purpose is to help us process our data, and test our scientific ideas about the data and indirectly the intuitions and hypotheses we had that led us to collect the data in the first place as well as the choices we made for how the data was to be collected.
* Detailed Installation Instructions
** Downloading R
    Downloading and installing R on (X)ubuntu is a one line command. Most other linux distributions will also have R in their package collections. However, sometimes the R distribution will update faster than the Linux package system tracks. Thus, it can be useful if you are using very new R tools or packages to follow a repository that more closely follows the R developers release cycles. 

    To install the base version of R on Xubuntu using the standard repositories you do: ~sudo apt install r-base~. If you want to track an R repository you could add to your current repositories first. Some additional tools may be necessary. 
    #+Name: track cran r repo
    #+Caption: They change the details often. See here https://cloud.r-project.org/bin/linux/ubuntu/ for latest instructions. 
    #+begin_src sh :eval never
    sudo apt-key adv --keyserver keyserver.ubuntu.com --recv-keys E298A3A825C0D65DFD57CBB651716619E084DAB9
    sudo add-apt-repository 'deb https://cloud.r-project.org/bin/linux/ubuntu focal-cran40/'
    #+end_src
    
    [[https://linuxize.com/post/how-to-install-r-on-ubuntu-20-04/][Source]]
** Testing Your R Installation from the Terminal
Always test! You can apply this philosophy in multiple ways at multiple times in programming, but the basic idea is that before you do a bunch of hard work verify that what you have will do what you want with as simple a test case as you can. This Minimal Reproducible test case is something you can easily share if you need to seek help figuring out how to solve a bug or other programming problem.

In our case we can,
    - open the terminal
    - type ~r~ then ~enter~
    - type ~2 + 2 enter~
    - And verify we  see 4
    - Then you can type ~quit()~ to exit the R interpreter.
** Test for R in Emacs
This assumes you have opened emacs.
     - ~M-x R~
     - if this doesn't work install ~ESS~ for emacs (Emacs Speaks Statistics)
     - Two choices:
       - MELPA (emacs package manager)
       - Ubuntu package: emacs-ess

* R Coding Basics
  Compare this material to that which was discussed for [[file:beginning-python.org::*Some programming vocabulary][programming vocabulary]] in Python. You should see a lot of similarities. This will be true for most languages you run into. Don't bind yourself to one language or try to force every square problem into the same round programming hole. Use the tool matched to the job. Once you get basic fluency with one language you will be able to fairly easily map to a new language. Of course it does pay to use one language predominantly so as to get expertise, but you should always be asking yourself when is the convenience of using what you know superseded by the facilities offered elsewhere. 
* Types
  R has many of the same data types as Python, but has some distinct ones as well. R makes a much greater use of lists where there are names and elements (rather like a Python dictionary). Many built-in statistical functions will return S3 or S4 objects that don't have a directly comparable Python equivalent. These special types in R facilitate being able to [[https://en.wikipedia.org/wiki/Pipeline_(computing)][pipe]] from one function to the next or to display concise summaries. 

** Determining the type of an R variable is straightforward.

  #+Name: typeof
  #+Caption: Use the function ~typeof~ in R to determine the datatype of a variable. 
  #+begin_src R :session *beginR* :exports both :results output
     a = 1
     typeof(a)
  #+end_src

  #+RESULTS: typeof
  : [1] "double"

  
** Lists and other data structures in R

  #+Name: Lists and Tuples and Data Frames
  #+Caption: Lists, Tuples, Data.Frames and Data.Tables
  #+begin_src R *beginR* :exports both :results value
    tpl = c(1,2)
    lst = list("firstName" = 'Britt', "lastName" = 'Anderson')
    df = data.frame('fn' = c("bob","jane","griffin"),"gndr" = c('m','f','o'))
    df
  #+end_src

  #+RESULTS: Lists and Tuples and Data Frames
  | bob     | m |
  | jane    | f |
  | griffin | o |


** Data Frames
Data Frames are one of the killer features of R, and they have been
slower to move into the Python space (though there are equivalents in
active development). You may also hear of =data.tables= in R. For your
purpose now you can think of them as the same, though as your R
comfort grows you will want to return to this issue and better
understand the pros and cons of switching from =data.frames= to
=data.tables=. You can think of =data.frames= as sort of like spread
sheets. But they are much handier. For example, let's look at the cars
data frame that comes as part of the base R installation. You can
verify it is installed like this.
  
     #+begin_src R :session *beginR* :exports both :results output
       is.data.frame(cars)
     #+end_src

     #+RESULTS:
     : [1] TRUE

