book/beginning-r.html

<div id="outline-container-org76d11aa" class="outline-2">
<h2 id="org76d11aa"><span class="section-number-2">6.</span> More: What is R</h2>
<div class="outline-text-2" id="text-6">
<p>
R is a programming language targeting data and its statistical analysis. 
</p>

<p>
The <a href="https://doi.org/10.1080/10618600.1996.10474713">history of R</a> is via a language called S and a version of Lisp called "Scheme." Thus, R occupies a rather unique place as a hybrid language. It has some functional features, while also having a lot of <a href="https://en.wikipedia.org/wiki/Domain-specific_language">domain specific</a> terminology.  
</p>

<p>
It's main purpose is to help us process our data, and test our scientific ideas about the data and indirectly the intuitions and hypotheses we had that led us to collect the data in the first place as well as the choices we made for how the data was to be collected.
</p>
</div>
</div>
<div id="outline-container-orgbe00cf7" class="outline-2">
<h2 id="orgbe00cf7"><span class="section-number-2">7.</span> Detailed Installation Instructions</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orga7c773f" class="outline-3">
<h3 id="orga7c773f"><span class="section-number-3">7.1.</span> Downloading R</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Downloading and installing R on (X)ubuntu is a one line command. Most other linux distributions will also have R in their package collections. However, sometimes the R distribution will update faster than the Linux package system tracks. Thus, it can be useful if you are using very new R tools or packages to follow a repository that more closely follows the R developers release cycles. 
</p>

<p>
To install the base version of R on Xubuntu using the standard repositories you do: <code>sudo apt install r-base</code>. If you want to track an R repository you could add to your current repositories first. Some additional tools may be necessary. 
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>They change the details often. See here <a href="https://cloud.r-project.org/bin/linux/ubuntu/">https://cloud.r-project.org/bin/linux/ubuntu/</a> for latest instructions.</label><pre class="src src-sh" id="orgeec0636">sudo apt-key adv --keyserver keyserver.ubuntu.com --recv-keys E298A3A825C0D65DFD57CBB651716619E084DAB9
sudo add-apt-repository <span style="color: #8b2252;">'deb https://cloud.r-project.org/bin/linux/ubuntu focal-cran40/'</span>
</pre>
</div>

<p>
<a href="https://linuxize.com/post/how-to-install-r-on-ubuntu-20-04/">Source</a>
</p>
</div>
</div>
<div id="outline-container-org817ce33" class="outline-3">
<h3 id="org817ce33"><span class="section-number-3">7.2.</span> Testing Your R Installation from the Terminal</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Always test! You can apply this philosophy in multiple ways at multiple times in programming, but the basic idea is that before you do a bunch of hard work verify that what you have will do what you want with as simple a test case as you can. This Minimal Reproducible test case is something you can easily share if you need to seek help figuring out how to solve a bug or other programming problem.
</p>

<p>
In our case we can,
</p>
<ul class="org-ul">
<li>open the terminal</li>
<li>type <code>r</code> then <code>enter</code></li>
<li>type <code>2 + 2 enter</code></li>
<li>And verify we  see 4</li>
<li>Then you can type <code>quit()</code> to exit the R interpreter.</li>
</ul>
</div>
</div>
<div id="outline-container-org5cbcb1f" class="outline-3">
<h3 id="org5cbcb1f"><span class="section-number-3">7.3.</span> Test for R in Emacs</h3>
<div class="outline-text-3" id="text-7-3">
<p>
This assumes you have opened emacs.
</p>
<ul class="org-ul">
<li><code>M-x R</code></li>
<li>if this doesn't work install <code>ESS</code> for emacs (Emacs Speaks Statistics)</li>
<li>Two choices:
<ul class="org-ul">
<li>MELPA (emacs package manager)</li>
<li>Ubuntu package: emacs-ess</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3c57fb1" class="outline-2">
<h2 id="org3c57fb1"><span class="section-number-2">8.</span> R Coding Basics</h2>
<div class="outline-text-2" id="text-8">
<p>
Compare this material to that which was discussed for <a href="beginning-python.html#orge6041d7">programming vocabulary</a> in Python. You should see a lot of similarities. This will be true for most languages you run into. Don't bind yourself to one language or try to force every square problem into the same round programming hole. Use the tool matched to the job. Once you get basic fluency with one language you will be able to fairly easily map to a new language. Of course it does pay to use one language predominantly so as to get expertise, but you should always be asking yourself when is the convenience of using what you know superseded by the facilities offered elsewhere. 
</p>
</div>
</div>
<div id="outline-container-org098f48b" class="outline-2">
<h2 id="org098f48b"><span class="section-number-2">9.</span> Types</h2>
<div class="outline-text-2" id="text-9">
<p>
R has many of the same data types as Python, but has some distinct ones as well. R makes a much greater use of lists where there are names and elements (rather like a Python dictionary). Many built-in statistical functions will return S3 or S4 objects that don't have a directly comparable Python equivalent. These special types in R facilitate being able to <a href="https://en.wikipedia.org/wiki/Pipeline_(computing)">pipe</a> from one function to the next or to display concise summaries. 
</p>
</div>

<div id="outline-container-org782dd7b" class="outline-3">
<h3 id="org782dd7b"><span class="section-number-3">9.1.</span> Determining the type of an R variable is straightforward.</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Use the function <code>typeof</code> in R to determine the datatype of a variable.</label><pre class="src src-R" id="orgc0d6874">a = 1
typeof(a)
</pre>
</div>

<pre class="example">
[1] "double"
</pre>
</div>
</div>


<div id="outline-container-org4da6d49" class="outline-3">
<h3 id="org4da6d49"><span class="section-number-3">9.2.</span> Lists and other data structures in R</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Lists, Tuples, Data.Frames and Data.Tables</label><pre class="src src-R" id="org6a0d25e">tpl = c(1,2)
lst = list(<span style="color: #8b2252;">"firstName"</span> = <span style="color: #8b2252;">'Britt'</span>, <span style="color: #8b2252;">"lastName"</span> = <span style="color: #8b2252;">'Anderson'</span>)
df = data.frame(<span style="color: #8b2252;">'fn'</span> = c(<span style="color: #8b2252;">"bob"</span>,<span style="color: #8b2252;">"jane"</span>,<span style="color: #8b2252;">"griffin"</span>),<span style="color: #8b2252;">"gndr"</span> = c(<span style="color: #8b2252;">'m'</span>,<span style="color: #8b2252;">'f'</span>,<span style="color: #8b2252;">'o'</span>))
df
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">bob</td>
<td class="org-left">m</td>
</tr>

<tr>
<td class="org-left">jane</td>
<td class="org-left">f</td>
</tr>

<tr>
<td class="org-left">griffin</td>
<td class="org-left">o</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org8d788f2" class="outline-3">
<h3 id="org8d788f2"><span class="section-number-3">9.3.</span> Data Frames</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Data Frames are one of the killer features of R, and they have been
slower to move into the Python space (though there are equivalents in
active development). You may also hear of <code>data.tables</code> in R. For your
purpose now you can think of them as the same, though as your R
comfort grows you will want to return to this issue and better
understand the pros and cons of switching from <code>data.frames</code> to
<code>data.tables</code>. You can think of <code>data.frames</code> as sort of like spread
sheets. But they are much handier. For example, let's look at the cars
data frame that comes as part of the base R installation. You can
verify it is installed like this.
</p>

<div class="org-src-container">
<pre class="src src-R">is.data.frame(cars)
</pre>
</div>

<pre class="example">
[1] TRUE
</pre>
</div>
