chapters/beginning-r.org
*** Selection by Booleans
In our Python section we learned about _predicates_ (or [[file:beginning-python.org::*Conditionals][conditionals]]). These were tests that returned true or false and that we could use in [[file:beginning-python.org::*While Loop][while loops]].
    
How many cars are there that can go faster than 10, but not more than 20?
    #+begin_src R :session *beginR* :exports both :results output
    length(cars$dist[cars$speed > 10 & cars$speed < 20])
    #+end_src

    #+RESULTS:
    : [1] 29


Can you do that easily in Excel?

What is going on here?
     1. ~cars~ is the name of the data frame.
     2. We access a /column/ of the data frame with the dollar sign notation ~cars$dist~. You can see the names of the columns in a data frame with ~names(cars)~.
     3. We use the square brackets to /index/ the column of data we are interested in. Here we do not use specific numbers, but rather we use a /boolean/ to compare the values in a column and we only include the ~TRUE~ values. Here we ask for all the indices where the speed is greater than 10, but less than 20, and we use those indices to get the values for the ~dist~ column. 

*** Accessing Data in R Assessment - Practice
      1. Sort (or ~order~) cars by the ~dist~ variable.
      2. Find the mean and standard deviation of the speed of the cars.
      3. Are there other datasets?
         #+begin_src R :export code :results hidden :eval never :session *beginR*
           library(help="datasets")
         #+end_src
      4. Open any of the datasets that catches your eye.
      5. What are the column names?
      6. How many rows?
      7. What is the /comment/ designator for R?
      8. What is the ending extension of an R script?

** Loops
  This is a good example of where things are slightly different between Python and R. R uses a more functional style and is sometimes called [[https://paulvanderlaken.com/2017/10/13/functional-programming-and-why-you-should-not-grow-vectors-in-r/][vectorizing]].
*** For Loop
         #+Name: For Loop in R
    #+begin_src R :session *beginR* :exports both :results output
           ml = seq(1:10)

           for  (m in ml) {
               print(m)
           }
    #+end_src

Compare to the Python code. Look for the ":" and the "{}"'s in both examples. You can see how your knowledge of looping in one language helps you understand looping in the other, but the details may be different.
*** Test your understanding
    1. Edit the above so that it prints the individual number each time it goes through the loop, and not the whole list.
    2. Repeat the [[file:~/gitRepos/introComp4Psych/assessments/forLoopPythonAssessment.org][Python Assessment]] on for loops, but using R this time. I give you a working example below, but try on your own for a while first, then look at my code and try it line by line in your interpreter to get the feel for how things work in R. 
       1. Create a list of at least 8 individual characters.
       2. Make sure they are **not** in alphabetical order
       3. Print the letters one at a time.
       4. Print the letters sorted alphabetically one at a time, but /do not/ overwrite your original list.
       5. Print the letters from both lists with a format command that says which position the letter is in.
       6. String formatting is less nice in R! To help with this look for help on ~paste~ and ~sprintf~. To acccess the /help/ try ~?<commandname>~.
   
    #+Name: Loop Exercise R
    #+begin_src R :exports both :results output :session *beginR*
      myName = "brittAnderson"
      myList = unlist(strsplit(myName,""))

      for (l in myList){
        print(l)
      }



      for (l in myList[order(myList)]){
        print(l)
      }

      i = 1
      for (n in order(myList)){
        t  <- sprintf("The %.0fth letter of myList is: %s, but is %s in the sorted list.",i,myList[i],myList[n])
        print(t)
        i = i+1  
        }
    #+end_src

** While Loop
*** Conditionals
    #+begin_src R :exports code  :session *beginR* :results output
              if (2 == 3) {
                  print("Wha.....?\n\n")
              } else if (3 == 2) {
                print("Now that is odd")
              } else {
                print("2 does not equal 3.")
              }
    #+end_src

    #+RESULTS:
    : [1] "2 does not equal 3."
*** While (again)
    #+begin_src R :exports both :session *beginR* :results output
              i = 0
              while (i<=10) {
                print(unlist(strsplit("brittAnderson",""))[i])
                i = i+1
              }
        #+end_src

        #+RESULTS:
	#+begin_example
	character(0)
	[1] "b"
	[1] "r"
	[1] "i"
	[1] "t"
	[1] "t"
	[1] "A"
	[1] "n"
	[1] "d"
	[1] "e"
	[1] "r"
	#+end_example

* Functions
#+begin_src R :exports code  :session *beginR*
  myadd  <- function(x,y) {
    return(x+y)
    }
#+end_src

#+begin_src R :exports both :results output :session *beginR*
myadd(2,3)
#+end_src

* Libraries for R
R too has its own package manager. You will usually want to let R manage its own packages. You do this from within R itself. Here are some code snippets showing this in practice.

  #+Name: Installing Packages in R
  #+Caption: Package Installation Commands in R. Note the use of quotes differs.
  #+begin_src R :session *beginR* :export code :eval never
  install.packages("data.table")
  install.packages("ggplot2")
  library(data.table)
  library(ggplot2)
  #+end_src
** What are some popular libraries? 
   Of particular note for us are:
   1. knitr
   2. rmarkdown
   3. ggplot2
   4. data.table
   5. magrittr
   6. devtools/githubinstall

