book/beginning-r.html

<div id="outline-container-orgc98d957" class="outline-4">
<h4 id="orgc98d957"><span class="section-number-4">9.3.1.</span> Selection by Booleans</h4>
<div class="outline-text-4" id="text-9-3-1">
<p>
In our Python section we learned about <span class="underline">predicates</span> (or <a href="beginning-python.html#org5fcbbbd">conditionals</a>). These were tests that returned true or false and that we could use in <a href="beginning-python.html#orgfa19f59">while loops</a>.
</p>

<p>
How many cars are there that can go faster than 10, but not more than 20?
</p>
<div class="org-src-container">
<pre class="src src-R">length(cars$dist[cars$speed &gt; 10 &amp; cars$speed &lt; 20])
</pre>
</div>

<pre class="example">
[1] 29
</pre>



<p>
Can you do that easily in Excel?
</p>

<p>
What is going on here?
</p>
<ol class="org-ol">
<li><code>cars</code> is the name of the data frame.</li>
<li>We access a <i>column</i> of the data frame with the dollar sign notation <code>cars$dist</code>. You can see the names of the columns in a data frame with <code>names(cars)</code>.</li>
<li>We use the square brackets to <i>index</i> the column of data we are interested in. Here we do not use specific numbers, but rather we use a <i>boolean</i> to compare the values in a column and we only include the <code>TRUE</code> values. Here we ask for all the indices where the speed is greater than 10, but less than 20, and we use those indices to get the values for the <code>dist</code> column.</li>
</ol>
</div>
</div>

<div id="outline-container-org9f34a90" class="outline-4">
<h4 id="org9f34a90"><span class="section-number-4">9.3.2.</span> Accessing Data in R Assessment - Practice</h4>
<div class="outline-text-4" id="text-9-3-2">
<ol class="org-ol">
<li>Sort (or <code>order</code>) cars by the <code>dist</code> variable.</li>
<li>Find the mean and standard deviation of the speed of the cars.</li>
<li><p>
Are there other datasets?
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #008b8b;">library</span>(help=<span style="color: #8b2252;">"datasets"</span>)
</pre>
</div></li>
<li>Open any of the datasets that catches your eye.</li>
<li>What are the column names?</li>
<li>How many rows?</li>
<li>What is the <i>comment</i> designator for R?</li>
<li>What is the ending extension of an R script?</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orge9772fd" class="outline-3">
<h3 id="orge9772fd"><span class="section-number-3">9.4.</span> Loops</h3>
<div class="outline-text-3" id="text-9-4">
<p>
This is a good example of where things are slightly different between Python and R. R uses a more functional style and is sometimes called <a href="https://paulvanderlaken.com/2017/10/13/functional-programming-and-why-you-should-not-grow-vectors-in-r/">vectorizing</a>.
</p>
</div>
<div id="outline-container-org16007f9" class="outline-4">
<h4 id="org16007f9"><span class="section-number-4">9.4.1.</span> For Loop</h4>
<div class="outline-text-4" id="text-9-4-1">
<div class="org-src-container">
<pre class="src src-R" id="org6714fb6">ml = seq(1:10)

<span style="color: #a020f0;">for</span>  (m <span style="color: #a020f0;">in</span> ml) {
    print(m)
}
</pre>
</div>

<pre class="example" id="org0166ede">
[1] 1
[1] 2
[1] 3
[1] 4
[1] 5
[1] 6
[1] 7
[1] 8
[1] 9
[1] 10
</pre>

<p>
Compare to the Python code. Look for the ":" and the "{}"'s in both examples. You can see how your knowledge of looping in one language helps you understand looping in the other, but the details may be different.
</p>
</div>
</div>
<div id="outline-container-orgefe189d" class="outline-4">
<h4 id="orgefe189d"><span class="section-number-4">9.4.2.</span> Test your understanding</h4>
<div class="outline-text-4" id="text-9-4-2">
<ol class="org-ol">
<li>Edit the above so that it prints the individual number each time it goes through the loop, and not the whole list.</li>
<li>Repeat the <a href="file:///home/britt/gitRepos/introComp4Psych/assessments/forLoopPythonAssessment.html">Python Assessment</a> on for loops, but using R this time. I give you a working example below, but try on your own for a while first, then look at my code and try it line by line in your interpreter to get the feel for how things work in R. 
<ol class="org-ol">
<li>Create a list of at least 8 individual characters.</li>
<li>Make sure they are <b><b>not</b></b> in alphabetical order</li>
<li>Print the letters one at a time.</li>
<li>Print the letters sorted alphabetically one at a time, but <i>do not</i> overwrite your original list.</li>
<li>Print the letters from both lists with a format command that says which position the letter is in.</li>
<li>String formatting is less nice in R! To help with this look for help on <code>paste</code> and <code>sprintf</code>. To acccess the <i>help</i> try <code>?&lt;commandname&gt;</code>.</li>
</ol></li>
</ol>

<div class="org-src-container">
<pre class="src src-R" id="org6d766b3">myName = <span style="color: #8b2252;">"brittAnderson"</span>
myList = unlist(strsplit(myName,<span style="color: #8b2252;">""</span>))

<span style="color: #a020f0;">for</span> (l <span style="color: #a020f0;">in</span> myList){
  print(l)
}



<span style="color: #a020f0;">for</span> (l <span style="color: #a020f0;">in</span> myList[order(myList)]){
  print(l)
}

i = 1
<span style="color: #a020f0;">for</span> (n <span style="color: #a020f0;">in</span> order(myList)){
  t  <span style="color: #008b8b;">&lt;-</span> sprintf(<span style="color: #8b2252;">"The %.0fth letter of myList is: %s, but is %s in the sorted list."</span>,i,myList[i],myList[n])
  print(t)
  i = i+1  
  }
</pre>
</div>

<pre class="example" id="orgc916a6f">
[1] "b"
[1] "r"
[1] "i"
[1] "t"
[1] "t"
[1] "A"
[1] "n"
[1] "d"
[1] "e"
[1] "r"
[1] "s"
[1] "o"
[1] "n"
[1] "A"
[1] "b"
[1] "d"
[1] "e"
[1] "i"
[1] "n"
[1] "n"
[1] "o"
[1] "r"
[1] "r"
[1] "s"
[1] "t"
[1] "t"
[1] "The 1th letter of myList is: b, but is A in the sorted list."
[1] "The 2th letter of myList is: r, but is b in the sorted list."
[1] "The 3th letter of myList is: i, but is d in the sorted list."
[1] "The 4th letter of myList is: t, but is e in the sorted list."
[1] "The 5th letter of myList is: t, but is i in the sorted list."
[1] "The 6th letter of myList is: A, but is n in the sorted list."
[1] "The 7th letter of myList is: n, but is n in the sorted list."
[1] "The 8th letter of myList is: d, but is o in the sorted list."
[1] "The 9th letter of myList is: e, but is r in the sorted list."
[1] "The 10th letter of myList is: r, but is r in the sorted list."
[1] "The 11th letter of myList is: s, but is s in the sorted list."
[1] "The 12th letter of myList is: o, but is t in the sorted list."
[1] "The 13th letter of myList is: n, but is t in the sorted list."
</pre>
</div>
</div>
</div>

<div id="outline-container-org831a39d" class="outline-3">
<h3 id="org831a39d"><span class="section-number-3">9.5.</span> While Loop</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-org3e2e08d" class="outline-4">
<h4 id="org3e2e08d"><span class="section-number-4">9.5.1.</span> Conditionals</h4>
<div class="outline-text-4" id="text-9-5-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #a020f0;">if</span> (2 == 3) {
    print(<span style="color: #8b2252;">"Wha.....?\n\n"</span>)
} <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (3 == 2) {
  print(<span style="color: #8b2252;">"Now that is odd"</span>)
} <span style="color: #a020f0;">else</span> {
  print(<span style="color: #8b2252;">"2 does not equal 3."</span>)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org87a9afc" class="outline-4">
<h4 id="org87a9afc"><span class="section-number-4">9.5.2.</span> While (again)</h4>
<div class="outline-text-4" id="text-9-5-2">
<div class="org-src-container">
<pre class="src src-R">i = 0
<span style="color: #a020f0;">while</span> (i&lt;=10) {
  print(unlist(strsplit(<span style="color: #8b2252;">"brittAnderson"</span>,<span style="color: #8b2252;">""</span>))[i])
  i = i+1
}
</pre>
</div>

<pre class="example" id="org105093d">
character(0)
[1] "b"
[1] "r"
[1] "i"
[1] "t"
[1] "t"
[1] "A"
[1] "n"
[1] "d"
[1] "e"
[1] "r"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6882e9a" class="outline-2">
<h2 id="org6882e9a"><span class="section-number-2">10.</span> Functions</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #0000ff;">myadd</span>  <span style="color: #008b8b;">&lt;-</span> <span style="color: #a020f0;">function</span>(x,y) {
  <span style="color: #a020f0;">return</span>(x+y)
  }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">myadd(2,3)
</pre>
</div>

<pre class="example">
[1] 5
</pre>
</div>
</div>

<div id="outline-container-orgf7fa9bf" class="outline-2">
<h2 id="orgf7fa9bf"><span class="section-number-2">11.</span> Libraries for R</h2>
<div class="outline-text-2" id="text-11">
<p>
R too has its own package manager. You will usually want to let R manage its own packages. You do this from within R itself. Here are some code snippets showing this in practice.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Package Installation Commands in R. Note the use of quotes differs.</label><pre class="src src-R" id="org7f067fa">install.packages(<span style="color: #8b2252;">"data.table"</span>)
install.packages(<span style="color: #8b2252;">"ggplot2"</span>)
<span style="color: #008b8b;">library</span>(data.table)
<span style="color: #008b8b;">library</span>(ggplot2)
</pre>
</div>
</div>
<div id="outline-container-orge20216b" class="outline-3">
<h3 id="orge20216b"><span class="section-number-3">11.1.</span> What are some popular libraries?</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Of particular note for us are:
</p>
<ol class="org-ol">
<li>knitr</li>
<li>rmarkdown</li>
<li>ggplot2</li>
<li>data.table</li>
<li>magrittr</li>
<li>devtools/githubinstall</li>
</ol>
</div>
</div>
</div>
