chapters/beginning-r.org
* Walking Through Some of R's Features
#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262930?h=894daf7c20" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262930">Hc : Walking Through the R Topic (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A video tour of ideas and concepts from the R topic file. I accidentally let this one go long (almost 1/2 hour). You may want to view it in parts as you read through the material.</p>
#+end_export

* Assessing your R Skills

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262936?h=62002be41d" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262936">Hd : Hints for the R Assessments (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>The R assessments ask you to work with data frames and do some text processing. I give some pointers and hints to how to approach this process.</p>
#+end_export


** Accessing Data in R - Assessment

*** Task
  Provide an org or Rmd file that demonstrates the following functions with the *cars* data set in R.
*** Goal/Purpose
  Demonstrate some of the basic data processing tasks in R. 
*** Instructions
**** General
   Using the built in data set *cars* demonstrate sorting and selection.
**** Detailed
   Produce a Rmd or org file that executes each of the following processes or provides as a result the answer to the listed questions. 
   - Sort (or ~order~) cars by the ~dist~ variable.
   - Find the =mean= and =standard deviation= of the speed of the cars.
   - Print the name of the other built-in data sets (this code may help)
        #+begin_src R :export code :results hidden :eval never
	  for (i in data()$results[,3]) {
	      print(i)
	      }
        #+end_src
   - Using any other data set find:
     1. Print the column names?
     2. Print how many rows?
     3. Tell me what the /comment/ designator is for R?
     4. Tell me what the ending extension is for an R script?

*** Comments
*** Hints
   - To find the names of /columns/ in a data.frame try the =names= function (~names(cars)~).
   - To get help you can type a *?* at the command line of the R interpreter.
   - You may need to find an online resource you like for R help, for example to find out what the name of the function is for standard deviation. It is not "standard deviation", but something much shorter.
   - Extensions: For instance "docx" is the extension for a word file and "py" is the extension for a python script. 

** Hangman in R 

*** Words of Encouragement
  This was hard in Python, and won't be trivial in R, but having done it once, the translation should be easier. But R is not as nice when processing text as is Python to text process as Python. So, I will be expecting less full featured functions. Just demonstrate you understand the concepts of what we are trying to achieve. 
*** Task
  To write the beginning pieces of a hangman game in R. This version will [[https://en.wikipedia.org/wiki/Hard_coding][hard code]] the word to be guessed. It will not produce any sort of graphic, but merely ask for letters and report if the player spells out the word or not.  Note that as R is harder to run as a program from the command line I will test your code by loading it into my R interpreter. The command for this is =source=.  I will download your =filename.R= and then I will =source(filename.R)=. Next, I will execute whatever function you tell me to. Remember, your script can contain comments so I should be able to tell what you want me to do just by reading your .R file. 
*** Detail (basically the same as before, with minor adaptations)
  1. Get input from me, the user. 
  2. Write a function that takes that input and and returns *a list of* indices of the positions where the input letter exists in your hard-coded word. An empty list means the letter is never in the word. Otherwise the elements of this list are the indices where that letter is found. For example, if the word were tree and the letter "e" you would get back =[1] 3 4= from this function. Remember that R starts counting from 1, not zero. , but would get back =integer(0)= if the letter were 's'. This weirdness tells you why R might be nicer for statistics, but not for text processing. Different task require different tools.
  3. Write a function that loops through the above process a certain number of times.
  4. Make the function terminate when all the letters are guessed or max number of guesses is exceeded.

*** Comments
*** How I Will Grade
   I will load (source) your file and try to test the functions. If they basically work then you will get the credits. 
*** Hints
   You might find the following R functions helpful:
   1. which
   2. strsplit
   3. unlist
   4. !=
   5. Using a variable more than once, e.g. al[al != "e"]
   


