book/beginning-r.html

<div id="outline-container-orgb0dbc38" class="outline-2">
<h2 id="orgb0dbc38"><span class="section-number-2">12.</span> Walking Through Some of R's Features</h2>
<div class="outline-text-2" id="text-12">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262930?h=894daf7c20" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262930">Hc : Walking Through the R Topic (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A video tour of ideas and concepts from the R topic file. I accidentally let this one go long (almost 1/2 hour). You may want to view it in parts as you read through the material.</p>
</div>
</div>

<div id="outline-container-orgd6ddc23" class="outline-2">
<h2 id="orgd6ddc23"><span class="section-number-2">13.</span> Assessing your R Skills</h2>
<div class="outline-text-2" id="text-13">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/460262936?h=62002be41d" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/460262936">Hd : Hints for the R Assessments (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>The R assessments ask you to work with data frames and do some text processing. I give some pointers and hints to how to approach this process.</p>
</div>


<div id="outline-container-org3d2568b" class="outline-3">
<h3 id="org3d2568b"><span class="section-number-3">13.1.</span> Accessing Data in R - Assessment</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-org5b0541f" class="outline-4">
<h4 id="org5b0541f"><span class="section-number-4">13.1.1.</span> Task</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Provide an org or Rmd file that demonstrates the following functions with the <b>cars</b> data set in R.
</p>
</div>
</div>
<div id="outline-container-orgdfa7623" class="outline-4">
<h4 id="orgdfa7623"><span class="section-number-4">13.1.2.</span> Goal/Purpose</h4>
<div class="outline-text-4" id="text-13-1-2">
<p>
Demonstrate some of the basic data processing tasks in R. 
</p>
</div>
</div>
<div id="outline-container-org57d107a" class="outline-4">
<h4 id="org57d107a"><span class="section-number-4">13.1.3.</span> Instructions</h4>
<div class="outline-text-4" id="text-13-1-3">
</div>
<ol class="org-ol">
<li><a id="org6d3fc4e"></a>General<br />
<div class="outline-text-5" id="text-13-1-3-1">
<p>
Using the built in data set <b>cars</b> demonstrate sorting and selection.
</p>
</div>
</li>
<li><a id="org1c56683"></a>Detailed<br />
<div class="outline-text-5" id="text-13-1-3-2">
<p>
Produce a Rmd or org file that executes each of the following processes or provides as a result the answer to the listed questions. 
</p>
<ul class="org-ul">
<li>Sort (or <code>order</code>) cars by the <code>dist</code> variable.</li>
<li>Find the <code>mean</code> and <code>standard deviation</code> of the speed of the cars.</li>
<li><p>
Print the name of the other built-in data sets (this code may help)
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">in</span> data()$results[,3]) {
    print(i)
    }
</pre>
</div></li>
<li>Using any other data set find:
<ol class="org-ol">
<li>Print the column names?</li>
<li>Print how many rows?</li>
<li>Tell me what the <i>comment</i> designator is for R?</li>
<li>Tell me what the ending extension is for an R script?</li>
</ol></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgbf5856a" class="outline-4">
<h4 id="orgbf5856a"><span class="section-number-4">13.1.4.</span> Comments</h4>
</div>
<div id="outline-container-org9442ea8" class="outline-4">
<h4 id="org9442ea8"><span class="section-number-4">13.1.5.</span> Hints</h4>
<div class="outline-text-4" id="text-13-1-5">
<ul class="org-ul">
<li>To find the names of <i>columns</i> in a data.frame try the <code>names</code> function (<code>names(cars)</code>).</li>
<li>To get help you can type a <b>?</b> at the command line of the R interpreter.</li>
<li>You may need to find an online resource you like for R help, for example to find out what the name of the function is for standard deviation. It is not "standard deviation", but something much shorter.</li>
<li>Extensions: For instance "docx" is the extension for a word file and "py" is the extension for a python script.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org62b6f76" class="outline-3">
<h3 id="org62b6f76"><span class="section-number-3">13.2.</span> Hangman in R</h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-orgc3e8bdd" class="outline-4">
<h4 id="orgc3e8bdd"><span class="section-number-4">13.2.1.</span> Words of Encouragement</h4>
<div class="outline-text-4" id="text-13-2-1">
<p>
This was hard in Python, and won't be trivial in R, but having done it once, the translation should be easier. But R is not as nice when processing text as is Python to text process as Python. So, I will be expecting less full featured functions. Just demonstrate you understand the concepts of what we are trying to achieve. 
</p>
</div>
</div>
<div id="outline-container-orgb689e22" class="outline-4">
<h4 id="orgb689e22"><span class="section-number-4">13.2.2.</span> Task</h4>
<div class="outline-text-4" id="text-13-2-2">
<p>
To write the beginning pieces of a hangman game in R. This version will <a href="https://en.wikipedia.org/wiki/Hard_coding">hard code</a> the word to be guessed. It will not produce any sort of graphic, but merely ask for letters and report if the player spells out the word or not.  Note that as R is harder to run as a program from the command line I will test your code by loading it into my R interpreter. The command for this is <code>source</code>.  I will download your <code>filename.R</code> and then I will <code>source(filename.R)</code>. Next, I will execute whatever function you tell me to. Remember, your script can contain comments so I should be able to tell what you want me to do just by reading your .R file. 
</p>
</div>
</div>
<div id="outline-container-org3c27e32" class="outline-4">
<h4 id="org3c27e32"><span class="section-number-4">13.2.3.</span> Detail (basically the same as before, with minor adaptations)</h4>
<div class="outline-text-4" id="text-13-2-3">
<ol class="org-ol">
<li>Get input from me, the user.</li>
<li>Write a function that takes that input and and returns <b>a list of</b> indices of the positions where the input letter exists in your hard-coded word. An empty list means the letter is never in the word. Otherwise the elements of this list are the indices where that letter is found. For example, if the word were tree and the letter "e" you would get back <code>[1] 3 4</code> from this function. Remember that R starts counting from 1, not zero. , but would get back <code>integer(0)</code> if the letter were 's'. This weirdness tells you why R might be nicer for statistics, but not for text processing. Different task require different tools.</li>
<li>Write a function that loops through the above process a certain number of times.</li>
<li>Make the function terminate when all the letters are guessed or max number of guesses is exceeded.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc86cefa" class="outline-4">
<h4 id="orgc86cefa"><span class="section-number-4">13.2.4.</span> Comments</h4>
</div>
<div id="outline-container-org0f159e6" class="outline-4">
<h4 id="org0f159e6"><span class="section-number-4">13.2.5.</span> How I Will Grade</h4>
<div class="outline-text-4" id="text-13-2-5">
<p>
I will load (source) your file and try to test the functions. If they basically work then you will get the credits. 
</p>
</div>
</div>
<div id="outline-container-org837e7b1" class="outline-4">
<h4 id="org837e7b1"><span class="section-number-4">13.2.6.</span> Hints</h4>
<div class="outline-text-4" id="text-13-2-6">
<p>
You might find the following R functions helpful:
</p>
<ol class="org-ol">
<li>which</li>
<li>strsplit</li>
<li>unlist</li>
<li>!=</li>
<li>Using a variable more than once, e.g. al[al != "e"]</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-01-13 Fri 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-05-29 Mon 10:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>